Revit 2024 API
ExternalResourceLoadStatus Enumeration
 A flag to indicate the status of an ExternalResource load request.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum ExternalResourceLoadStatus
Visual Basic
Public Enumeration ExternalResourceLoadStatus
Visual C++
public enum class ExternalResourceLoadStatus
Members
Member name | Description
Success |  The load operation was successful.
Failure |  The load operation failed.
Uninitialized |  The load operation is in an incomplete state. Revit will treat this result as a failure.
ResourceAlreadyCurrent |  The current version of the resource is already loaded into Revit so no changes were made to the model.
CannotFindServer |  The server identified by the ExternalResourceReference could not be found, and may not be registered.
ServerThrewException |  The server identified by the ExternalResourceReference threw an exception while attempting to load a resource.
Remarks
 This flag is returned by the LoadResource method of the IExternalResourceServer class to inform callers whether the load operation succeeded, or encountered an error.
See Also
Autodesk.Revit.DB Namespace